{
  "header": {
    "home": "Inici",
    "KnowMe": "Coneix-me una mica més",
    "aboutMe": "Sobre mi",
    "whatdoIoffer": "Què ofereixo?",
    "training": "Formació",
    "skills": "Competències",
    "certifications": "Certificacions",
    "contact": "Contacte",
    "helloWorld": "Hola món!",
    "Im":"sóc Andrea, una programadora web"
  },
  "sectionInformation": {
    "professionalism": {
      "title": "100% professionalitat",
      "description": "Estic compromès a oferir-te un servei de qualitat i professionalitat excepcional, en la creació del teu lloc web. Estic aquí per proporcionar-te una experiència de disseny web i funcionalitat, ràpida, precisa i adaptada a totes les teves necessitats."
    },
    "advice": {
      "title": "T'aconsello a escollir la millor opció per a la teva empresa",
      "description": "Estic aquí per ajudar-te a trobar la millor solució per al teu projecte. Si necessites orientació sobre les millors opcions disponibles, estaré encantat de oferir-te la millor opció per a tu i el teu treball, el mateix si ja tens un lloc web i vols adaptar un nou disseny o funcionalitat."
    },
    "devices": {
      "title": "El teu lloc web en qualsevol dispositiu",
      "description": "Treballo diligentment per assegurar-me que cada element del teu lloc web estigui perfectament optimitzat i adaptable a diferents mides de pantalla. Avui en dia, naveguem cap a dispositius mòbils, així que és important dedicar una part del desenvolupament al disseny adaptable."
    }
  },
  "skills": {
    "markupLanguage": "Domini profund del llenguatge de marcat, el que em permet crear i estructurar contingut de manera clara i concisa.",
    "webInterfaceDesign": "Creo i dissenyo interfícies web amb estil i elegància, sense oblidar la responsivitat en tots els dispositius.",
    "javascriptKnowledge": "Coneixement sòlid de les principals funcionalitats de Javascript, i segueixo en continu aprenentatge.",
    "reactExperience": "Actualment porto diversos mesos perfeccionant-me en el domini de React, aquesta mateixa pàgina està construïda en React.",
    "databaseExperience": "La meva experiència abasta aspectes fonamentals com la creació de bases de dades i col·leccions, disseny de consultes bàsiques i manipulació de documents.",
    "bootstrapKnowledge": "Bon coneixement de Bootstrap, solc utilitzar-lo en diversos projectes.",
    "dailyUsage": "En el meu dia a dia, no puc prescindir de Git, m'ha acompanyat en tota aquesta aventura, el 100% del meu temps.",
    "gitExperience": "Al igual que Github, Git sempre ha estat en el meu curs d'aprenentatge, l'estudi ha estat diari.",
    "tailwindExperience": "He treballat assíduament amb Tailwind, el que m'ha proporcionat un domini profund i equilibrat d'aquest framework."
  },
  "certificationsGoogle": {
    "june": "Juny de 2023",
    "course": "Curs d'introducció",
    "coursetitle": "al desenvolupament web: HTML i CSS (I)",
    "summary": "Resum",
    "topics": {
    "history": "Història de la Web",
    "functioning": "Com funciona la Web",
    "writing": "Com s'escriu per a la Web",
    "publication": "Publicació d'un lloc web",
    "page": "Creació d'una pàgina web"
    }
    },
  "certificationsGoogle1": {
    "july": "Juliol 2023",
    "course": "Curs d'introducció ",
    "coursetitle": "al desenvolupament web: HTML and CSS (II)",
    "summary": "Sumari",
    "topics": {
      "presentationDefinition": "Com es defineix la presentació d'una pàgina web",
      "elementsPresentationDefinition": "Com es defineix la presentació dels elements d'una pàgina web",
      "webSuccessAchievement": "Com aconseguir que una pàgina web tingui èxit",
      "webLayout": "Com maquetar una pàgina web"
    }
  },
  "certificationsUdemy": {
    "august": "Agost 2023",
    "course": "Construcció de llocs web responsius del món real amb HTML i CSS (Udemy)",
    "summary": "Resum",
    "topics": {
      "htmlFundamentals": "Fonaments d'HTML",
      "cssFundamentals": "Fonaments de CSS",
      "layouts": "Disposicions",
      "components": "Components",
      "projects": "Projectes"
    }
  },
  "certificationsFreeCodeCamp": {
    "certification_info": {
      "title": "Setembre 2023",
      "subtitle": "Certificació de Disseny Web Responsiu i Desenvolupament",
      "image_source": "https://www.arnoldgelacio.com/images/skills/logo-freecodecamp.png",
      "summary": {
        "title": "Resum 300h",
        "details": [
          "Construeix un formulari d'enquesta",
          "Construeix una pàgina de tribut",
          "Construeix una pàgina de documentació tècnica",
          "Construeix una pàgina de cartera personal"
        ]
      }
    }
  },

  "footer": {

   
    "text": "Dissenyadora de pàgines web i programadora web",
    "contactUs": "Contacteu-nos",
    "privacyPolicy": "Política de privacitat"
  }
}