{
  "header": {
    "home": "Home",
    "KnowMe": "Know Me More",
    "aboutMe": "About Me",
    "whatdoIoffer": "What Do I Offer?",
    "training": "Training",
    "skills": "Skills",
    "projects": "Projects",
    "certifications": "Certifications",
    "courses": "Courses",
    "contact": "Contact",
    "helloWorld": "Hello World,",
    "Im": "I'm Andrea, a Web Developer"
  },
  "sectionInformation": {
    "professionalism": {
      "title": "100% professionalism",
      "description": "I am committed to offering you a service of quality and exceptional professionalism, in the creation of your website. I am here to provide you with a web design and functionality experience, fast, precise, and adapted to all your needs."
    },
    "advice": {
      "title": "I advise you to choose the best option for your company",
      "description": "I am here to help you find the best solution for your project. If you need guidance on the best available options, I will be happy to offer you my best option for you and your work, the same if you already have a website and want to adapt a new design or functionality."
    },
    "devices": {
      "title": "Your website on any device",
      "description": "I work diligently to ensure that each element of your website is perfectly optimized and adaptable to different screen sizes. Nowadays, we navigate everything towards mobile devices, so it is important to dedicate a part of the development to responsive design."
    }
  },
  "skills": {
    "markupLanguage": "Deep domain of markup language, allowing me to create and structure content clearly and concisely.",
    "webInterfaceDesign": "I create and design web interfaces with style and elegance, without forgetting responsiveness on all devices.",
    "javascriptKnowledge": "Solid knowledge of the main functionalities of Javascript, and I continue to learn continuously.",
    "reactExperience": "I have been perfecting my skills in React for several months now, this very page is built in React.",
    "databaseExperience": "My experience covers fundamental aspects such as creating databases and collections, designing basic queries, and document manipulation.",
    "bootstrapKnowledge": "Good knowledge of Bootstrap, I often use it in various projects.",
    "dailyUsage": "In my daily life, I cannot do without Git, it has accompanied me throughout this adventure, 100% of my time.",
    "gitExperience": "Like Github, Git has always been in my learning course, studying has been daily.",
    "tailwindExperience": "I have worked diligently with Tailwind, which has provided me with a deep and balanced mastery of this framework.",
    "angularExperience": "My experience with Angular has led me to explore the latest versions, creating projects in Angular 17 and 18. I stay up to date with the new features in Angular 19.",
    "leafletExperience": "With Leaflet, I have learned to integrate interactive maps in React and Angular applications. I have worked with features like custom markers, layers, and real-time video streaming. This experience has allowed me to dive deeper into the integration of lightweight maps with dynamic data, enhancing user interaction and experience.",
    "maplibreExperience": "With Maplibre, I have gained skills to visualize large datasets on dynamic vector maps. I have learned to work with clusters to group points by categories, customize map styles, and manage complex open-source data. This experience has helped me better understand how to organize and present geospatial information effectively and attractively.",
    "openlayersExperience": "With OpenLayers, I have learned to implement advanced features for managing geospatial data. I have developed tools to add points with descriptions, draw lines, polygons, and circles, and enable search by descriptions. I have also gained knowledge to generate, export, and import GeoJSON files, deepening my understanding of data manipulation and its interoperability in GIS applications.",
    "mapboxExperience": "With Mapbox, I have learned to develop interactive map visualizers to display dynamic geospatial data. I have gained skills in integrating custom maps, managing data by date and location, and visualizing the water levels of the dams in Catalonia through dynamic layers, improving user interaction with geospatial information.",
    "primeNgExperience": "I have worked with PrimeNG to integrate rich and interactive UI components into my applications. I have used several components such as tables, forms, menus, and search bars to improve user experience and development efficiency.",
    "primeReactExperience": "I have worked with PrimeReact to integrate advanced UI components into my React applications. I have used several components like tables, forms, calendars, and charts to improve functionality and user experience, facilitating the development of modern and efficient interfaces."
  },
  "certifications1": [
    {
      "id": 1,
      "month": "2024",
      "course": "Introduction to Web Development Course",
      "institution": "Google Activate",
      "instructor": "University of Alicante",
      "image": "./imgtec/google.jpg",
      "backgroundImage": "https://img.freepik.com/vector-gratis/fondo-textura-elegante-blanco_23-2148429089.jpg?t=st=1738169611~exp=1738173211~hmac=8c71a8ec896a9f5ccfd84171a3f94fefca2c863dfe80c1e78c4b9e3ef7fbc40e&w=826",
      "summary": "Summary",
      "gradient": "linear-gradient(to bottom, rgba(167, 184, 227, 0.269), rgba(16, 90, 239, 0.358))",
      "topics": [
        "History of the Web",
        "How the Web works",
        "How to write a web page",
        "How to publish a website",
        "How to write a well-structured web page"
      ]
    },
    {
      "id": 2,
      "month": "2023",
      "course": "Introduction to Web Development Course: HTML and CSS",
      "institution": "Google Activate",
      "instructor": "University of Alicante",
      "image": "https://www.emprendedorinteligente.com/wp-content/uploads/2019/11/header-activate-logo-lg-1024x286.png",
      "backgroundImage": "https://img.freepik.com/vector-gratis/fondo-textura-elegante-blanco_23-2148429089.jpg?t=st=1738169611~exp=1738173211~hmac=8c71a8ec896a9f5ccfd84171a3f94fefca2c863dfe80c1e78c4b9e3ef7fbc40e&w=826",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(245, 90, 239, 0.358))",
      "topics": [
        "How to define the presentation of a web page",
        "How to define the presentation of web page elements",
        "How to layout a web page",
        "How to make a website successful"
      ]
    },
    {
      "id": 3,
      "month": "2023",
      "course": "Responsive Web Design, Developer Certification",
      "institution": "FreeCodeCamp",
      "instructor": "",
      "image": "https://th.bing.com/th/id/OIP.oqGWRSjVvq--EULjpyw6ZQHaA5?rs=1&pid=ImgDetMain",
      "backgroundImage": "https://img.freepik.com/vector-gratis/fondo-textura-elegante-blanco_23-2148429089.jpg?t=st=1738169611~exp=1738173211~hmac=8c71a8ec896a9f5ccfd84171a3f94fefca2c863dfe80c1e78c4b9e3ef7fbc40e&w=826",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(245, 90, 239, 0.358))",
      "topics": [
        "Tribute Page",
        "Technical documentation page (certification project)",
        "Product landing page (certification project)",
        "JavaScript algorithms and projects",
        "Create your own portfolio"
      ]
    },
    {
      "id": 4,
      "month": "2023",
      "course": "Algorithms and Data Structures in JavaScript",
      "institution": "FreeCodeCamp",
      "instructor": "",
      "image": "https://th.bing.com/th/id/OIP.oqGWRSjVvq--EULjpyw6ZQHaA5?rs=1&pid=ImgDetMain",
      "backgroundImage": "https://img.freepik.com/vector-gratis/fondo-textura-elegante-blanco_23-2148429089.jpg?t=st=1738169611~exp=1738173211~hmac=8c71a8ec896a9f5ccfd84171a3f94fefca2c863dfe80c1e78c4b9e3ef7fbc40e&w=826",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(245, 90, 239, 0.358))",
      "topics": [
        "Basic JavaScript",
        "ES6",
        "Regular expressions",
        "Debugging",
        "Basic data structures",
        "Basic algorithm scripting",
        "Object-oriented programming",
        "Functional programming",
        "Intermediate algorithm scripting",
        "JavaScript algorithms and data structures projects",
        "Palindrome checker",
        "Roman numeral converter",
        "Caesar cipher",
        "Phone number validator",
        "Cash register"
      ]
    }
  ],

  
    "projects": [
      {
        "id": 1,
        "title": "Traffic Valéncia",
        "description": "Traffic Valéncia is a website developed with JS that geolocates all the traffic cameras in the metropolitan area of Valencia. Users can check live streams from the cameras, providing a practical and visual tool to monitor traffic conditions in the city.",
        "description1": "Traffic Valéncia uses data provided by the open data portal of the City Council of Valencia. It also incorporates a lightweight library 'leaflet-control-geocoder', allowing users to geolocate specific destinations in a simple and intuitive way. It is designed with Tailwind CSS, ensuring a modern style with an attractive visual experience, focusing on mobile-first."
      },
      {
        "id": 2,
        "title": "Mexico Guide",
        "description": "Mexico Guide is a website developed with JS, an interactive guide that allows geolocation of Mexico's most important tourist destinations, Maya treasures, archaeological sites, and UNESCO World Heritage locations, all displayed with geolocation markers (colored clusters) for a clear user experience.",
        "description1": "Each geolocation includes a description and a small gallery of photos of the place, developed with Google APIs. The geolocation data is provided by the Institute of Geography of UNAM (Mexico), from the IDEA platform."
      },
      {
        "id": 3,
        "title": "Cleopatra Cosmétics",
        "description": "Cleopatra Cosmétics is an e-commerce website developed with React, specializing in luxury cosmetic products. The clean and simple design allows users to clearly view the main features, guiding customers through the different purchase processes. The checkout process is ready to be connected to a database, and the physical store is geolocated using React Leaflet."
      },
      {
        "id": 4,
        "title": "Harry Potter App",
        "description": "Harry Potter is a website developed with Angular 17, where you can find all the information about Harry Potter. The data is collected from the HP-API, allowing the rendering of the main characters, professors, students, and all spells related to the Harry Potter Universe."
      },
      {
        "id": 5,
        "title": "SpaceAirTracker",
        "description": "SpaceAirTracker is a website developed with Angular 17 and the OpenLayers library. It is a tracker for national and international flights, allowing users to geolocate the flight and know its speed, ICAO, latitude, and country of origin. It also allows tracking flights based on the city of origin. Its clean and functional style is designed with Bootstrap."
      },
      {
        "id": 6,
        "title": "Claustrum Aqvae",
        "description": "Claustrum Aqvae is developed with Angular 17. It is a website that measures the status of the dams in Catalonia. For the interactive map and animations, I have used the Mapbox library combined with the Mapbox Places API to geolocate all the dams in the Catalonia region. It allows searching by day for any dam and provides the measurement data of the selected dam.",
        "description1": "For the design, I have used the Tailwind library. To display the data, I have used the 'Dades Obertes de Catalunya' portal."
      },
      {
        "id": 7,
        "title": "The Holy Wine",
        "description": "The Holy Wine is developed with the latest version of Angular, Angular 19, utilizing the latest features in the framework's directives. For the design, I have used Angular Material and Tailwind CSS.",
        "description1": "You can search by wine or location, with over 10,000 entries. It includes a section explaining different grape varieties in the database and allows users to learn about some of the exclusive wine tasters by scanning the QR code attached to the cards."
      },
      {
        "id": 8,
        "title": "ThunderAI",
        "description": "ThunderAI is developed with JS, Vite, and Tailwind. Using the artificial intelligence models provided by the Hugging Face platform, I have utilized the latest DeepSeek R3 model.",
        "description1": "You can ask it anything in any language or complexity. The interface is clean and modern."
      },

      {
        "id": 9,
        "title": "Bitácora Map",
        "description": "Bitácora Map is developed with Angular 17, OpenLayers, and Bootstrap. It is the perfect tool to complement your travels and share information with whoever you want. It allows you to add markers, draw polygons and lines, add comments, and edit them easily. Additionally, data can be saved in LocalStorage for access at any time.",
        "description1": "It offers the ability to download and upload GeoJSON files."
      }
    ],
  
  


  "courses": [
    {
      "id": 1,
      "month": "2023",
      "course": "Create real-world responsive websites with HTML and CSS",
      "institution": "Udemy",
      "instructor": "Jonas Schmedtmann",
      "image": "https://www.emprendedorinteligente.com/wp-content/uploads/2019/11/header-activate-logo-lg-1024x286.png",
      "summary": "Projects",
      "gradient": "linear-gradient(to bottom, rgba(167, 184, 227, 0.269), rgba(16, 90, 239, 0.358))",
      "topics": [
        "Modern, semantic, and accessible HTML5",
        "Important CSS concepts like the box model, positioning schemes, inheritance, selector conflict resolution, etc.",
        "Design and build an impactful project for your portfolio from scratch",
        "Omnifood Web Project"
      ]
    },
    {
      "id": 2,
      "month": "2023",
      "course": "Program your own HTML5 games with CSS",
      "institution": "Udemy",
      "instructor": "Javier Muñiz",
      "image": "https://www.emprendedorinteligente.com/wp-content/uploads/2019/11/header-activate-logo-lg-1024x286.png",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(245, 90, 239, 0.358))",
      "topics": [
        "Create a Tetris",
        "The Dungeon"
      ]
    },
    {
      "id": 3,
      "month": "2024",
      "course": "Algorithms and data structures in JavaScript",
      "institution": "Udemy",
      "instructor": "Juan Pablo de la Torre",
      "image": "https://th.bing.com/th/id/OIP.DjzcfrlwLev0VKX5KpppDgHaHa?rs=1&pid=ImgDetMain",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(390, 90, 239, 0.358))",
      "topics": [
        "Basic JavaScript",
        "ES6",
        "Regular Expressions",
        "Debugging",
        "Basic data structures",
        "Basic algorithm programming",
        "Object-oriented programming",
        "Functional programming",
        "Intermediate algorithm programming",
        "JavaScript algorithms and projects"
      ]
    },
    {
      "id": 4,
      "month": "2024",
      "course": "The Git & Github BootCamp",
      "institution": "Udemy",
      "instructor": "Colt Steele",
      "image": "https://th.bing.com/th/id/OIP.DjzcfrlwLev0VKX5KpppDgHaHa?rs=1&pid=ImgDetMain",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(390, 90, 239, 0.358))",
      "topics": [
        "Master the essential Git workflow: adding and committing changes",
        "Perform Git merges and resolve merge conflicts",
        "Use Git diff to reveal changes over time",
        "Master Git stashing",
        "Undo changes using git restore, git revert, and git reset",
        "Work with local and remote repositories",
        "Master collaboration workflows: pull requests",
        "Fork and clone repositories",
        "Clean up, compact, and rewrite history using interactive rebase",
        "Recover 'lost' work using git reflogs",
        "Write custom and powerful Git aliases",
        "Tag versions and releases using Git tags",
        "Host static websites using Github Pages",
        "Create README files in markdown format",
        "Share code and snippets using Github Gists"
      ]
    },
    {
      "id": 5,
      "month": "2024",
      "course": "The Modern React BootCamp",
      "institution": "Udemy",
      "instructor": "Colt Steele",
      "image": "https://th.bing.com/th/id/OIP.DjzcfrlwLev0VKX5KpppDgHaHa?rs=1&pid=ImgDetMain",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(390, 90, 239, 0.358))",
      "topics": [
        "The basics of React (props, state, etc)",
        "Build many projects, each with a beautiful interface",
        "Complex forms and validations in React",
        "React Hooks!",
        "Integrate React with APIs",
        "Next"
      ]
    },
    {
      "id": 6,
      "month": "2024",
      "course": "Master in React: Learn ReactJs, Hooks, MERN NodeJs, JWT+",
      "institution": "Udemy",
      "instructor": "Victor Robles",
      "image": "https://th.bing.com/th/id/OIP.DjzcfrlwLev0VKX5KpppDgHaHa?rs=1&pid=ImgDetMain",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(390, 90, 239, 0.358))",
      "topics": [
        "Master React",
        "Learn React with Hooks",
        "Learn React Router DOM",
        "Work with the most modern React Router",
        "Learn Context API",
        "Learn the MERN Stack",
        "Learn Vite",
        "Create web applications with React",
        "Develop services and RESTful APIs with NodeJS, Express, and MongoDB",
        "Reducers, Context, and state controllers",
        "Create a complete portfolio with React",
        "Create a complete blog with ReactJS",
        "Create a complete social network with React JS",
        "Develop web applications with the MERN Stack",
        "Develop SPA web applications",
        "Improve adaptability to other JavaScript frameworks"
      ]
    },
    {
      "id": 7,
      "month": "2024/2025",
      "course": "Angular from Zero to Expert",
      "institution": "Udemy",
      "instructor": "Fernando Herrera",
      "image": "https://th.bing.com/th/id/OIP.DjzcfrlwLev0VKX5KpppDgHaHa?rs=1&pid=ImgDetMain",
      "summary": "Course summary",
      "gradient": "linear-gradient(to bottom, rgba(129, 184, 227, 0.269), rgba(390, 90, 239, 0.358))",
      "topics": [
        "Angular in depth",
        "Develop your own applications using Angular",
        "Follow framework standards and best practices",
        "Learn TypeScript-based Angular",
        "Use third-party libraries",
        "Learn other related topics in Angular application development"
      ]
    }
  ],
  "sobreMi": {
   "ini": "hello!!",
   "instructions": "instructions",
   "intro": "Enter prompts, to view the message via the terminal",
  "bienvenida": "Welcome to my terminal!!",
  "fecha": "Today is",
  "quienSoy": "My name is Andrea, and I am from Girona. I’ve been developing websites for over a year and a half in the Frontend sector. My favorite frameworks are Angular and React.",
  "unMundoDescubierto": "Since I discovered this world, about a year ago, I’ve dived into this exciting journey of constant learning and personal growth, and I’ve learned that nothing is impossible to achieve if you work hard and with discipline.",
  "viajeLenguajes": "During this journey, I’ve gained experience in Frontend Web development and my first steps in Backend, using the most in-demand technologies in this career: HTML, CSS, Javascript, React, Node, MongoDb.",
  "gracias": "If you've come this far, I wanted to thank you for taking your time to get to know me a little more. If you have any questions or want to know more about me, don't hesitate to contact me. Thank you!",
  "help": "Available commands:",
  "commands": {
    "init": "Initializes the terminal.",
    "date": "Shows the current date.",
    "bienvenida": "An initial greeting and guide.",
    "quienSoy": "Information about me.",
    "unMundoDescubierto": "My introduction to development.",
    "viajeLenguajes": "Technologies and projects.",
    "gracias": "Thank you message.",
    "clear": "Clears the terminal.",
    "help": "Shows this list of commands."
  },
  "unknownCommand": "Unknown command",
  "placeholder": "Enter a command"


  },
  
  "Contact": {
    "contact": "Contact",
    "you wants": "Do you want advice, guidance, or do you want to share your idea for your website? Get in touch with me.",
    "name": "Name",
    "email": "Email",
    "NameEmail": "Full Name",
    "you want": "What would you like to ask me?",
    "Submit": "Send"
  },
  "footer": {
    "text": "Web designer and web developer:",
    "AllReserve": "All rights reserved"
  }
}