{
    "header": {
        "home": "Home",
        "KnowMe": "Know Me More",
        "aboutMe": "About Me",
        "whatdoIoffer": "What Do I Offer?",
        "training": "Training",
        "skills": "Skills",
        "projects":"Projects",
        "certifications": "Certifications",
        "contact": "Contact",
        "helloWorld": "Hello World,",
        "Im": "I'm Andrea, a Web Developer"
    },
    "sectionInformation": {
        "professionalism": {
            "title": "100% professionalism",
            "description": "I am committed to offering you a service of quality and exceptional professionalism, in the creation of your website. I am here to provide you with a web design and functionality experience, fast, precise, and adapted to all your needs."
        },
        "advice": {
            "title": "I advise you to choose the best option for your company",
            "description": "I am here to help you find the best solution for your project. If you need guidance on the best available options, I will be happy to offer you my best option for you and your work, the same if you already have a website and want to adapt a new design or functionality."
        },
        "devices": {
            "title": "Your website on any device",
            "description": "I work diligently to ensure that each element of your website is perfectly optimized and adaptable to different screen sizes. Nowadays, we navigate everything towards mobile devices, so it is important to dedicate a part of the development to responsive design."
        }
    },
    "skills": {
        "markupLanguage": "Deep domain of markup language, allowing me to create and structure content clearly and concisely.",
        "webInterfaceDesign": "I create and design web interfaces with style and elegance, without forgetting responsiveness on all devices.",
        "javascriptKnowledge": "Solid knowledge of the main functionalities of Javascript, and I continue to learn continuously.",
        "reactExperience": "I have been perfecting my skills in React for several months now, this very page is built in React.",
        "databaseExperience": "My experience covers fundamental aspects such as creating databases and collections, designing basic queries, and document manipulation.",
        "bootstrapKnowledge": "Good knowledge of Bootstrap, I often use it in various projects.",
        "dailyUsage": "In my daily life, I cannot do without Git, it has accompanied me throughout this adventure, 100% of my time.",
        "gitExperience": "Like Github, Git has always been in my learning course, studying has been daily.",
        "tailwindExperience": "I have worked diligently with Tailwind, which has provided me with a deep and balanced mastery of this framework.",
        "angularExperience": "My experience with Angular has led me to explore the latest versions, creating projects in Angular 17 and 18. I stay up to date with the new features in Angular 19.",
        "leafletExperience": "With Leaflet, I have learned to integrate interactive maps in React and Angular applications. I have worked with features like custom markers, layers, and real-time video streaming. This experience has allowed me to dive deeper into the integration of lightweight maps with dynamic data, enhancing user interaction and experience.",
        "maplibreExperience": "With Maplibre, I have gained skills to visualize large datasets on dynamic vector maps. I have learned to work with clusters to group points by categories, customize map styles, and manage complex open-source data. This experience has helped me better understand how to organize and present geospatial information effectively and attractively.",
        "openlayersExperience": "With OpenLayers, I have learned to implement advanced features for managing geospatial data. I have developed tools to add points with descriptions, draw lines, polygons, and circles, and enable search by descriptions. I have also gained knowledge to generate, export, and import GeoJSON files, deepening my understanding of data manipulation and its interoperability in GIS applications.",
        "mapboxExperience": "With Mapbox, I have learned to develop interactive map visualizers to display dynamic geospatial data. I have gained skills in integrating custom maps, managing data by date and location, and visualizing the water levels of the dams in Catalonia through dynamic layers, improving user interaction with geospatial information.",
        "primeNgExperience": "I have worked with PrimeNG to integrate rich and interactive UI components into my applications. I have used several components such as tables, forms, menus, and search bars to improve user experience and development efficiency.",
        "primeReactExperience": "I have worked with PrimeReact to integrate advanced UI components into my React applications. I have used several components like tables, forms, calendars, and charts to improve functionality and user experience, facilitating the development of modern and efficient interfaces."
    },
    "certificationsGoogle": {
        "june": "June 2023",
        "course": "Introduction Course",
        "coursetitle": "to Web Development: HTML and CSS (I)",
        "summary": "Summary",
        "topics": {
            "history": "History of the Web",
            "functioning": "How the Web Works",
            "writing": "Writing for the Web",
            "publication": "Publishing a Website",
            "page": "Creating a Web Page"
        }
    },
    "certificationsGoogle1": {
        "july": "July 2023",
        "course": "Introduction",
        "coursetitle": "to Web Development: HTML and CSS (II)",
        "summary": "Summary",
        "topics": {
            "presentationDefinition": "How the presentation of a web page is defined",
            "elementsPresentationDefinition": "How the presentation of the elements of a web page is defined",
            "webSuccessAchievement": "How to achieve success for a web page",
            "webLayout": "How to layout a web page"
        }
    },
    "certificationsUdemy": {
        "august": "August 2023",
        "course": "Build Responsive Real World Websites with HTML AND CSS (Udemy)",
        "summary": "Summary",
        "topics": {
            "htmlFundamentals": "HTML Fundamentals",
            "cssFundamentals": "CSS Fundamentals",
            "layouts": "Layouts",
            "components": "Components",
            "projects": "Projects"
        }
    },
    "certificationsFreeCodeCamp": {
        "certification_info": {
            "title": "September 2023",
            "subtitle": "Responsive Web Design Developer Certification",
            "image_source": "https://www.arnoldgelacio.com/images/skills/logo-freecodecamp.png",
            "summary": {
                "title": "Summary 300h",
                "details": [
                    "Build a Survey Form",
                    "Build a tribute page",
                    "Build a Technical Documentation Page",
                    "Build a Personal Portfolio Page"
                ]
            }
        }
    },
    "footer": {
        "contactUs": "Contact Us",
        "privacyPolicy": "Privacy Policy"
    }
}